src/main/test/supply-chain/0-Validation/0-Apply Tax/2-01_01_03_TaxCalculation_only/3-TC01.01.03.04_CNOR_BUT_BUC_validation/1-TC01.01.03.04_CNOR_BUT_BUC_validation_2/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
        
    <arg0>
     <DocumentId>
               <SystemSourceId>FRIM001</SystemSourceId>
               <TransactionId/>
            </DocumentId>
            <AlternateDocumentId>
               <CustomField1>CustomField1</CustomField1>
               <CustomField2/>
               <CustomField3/>
               <CustomField4/>
               <CustomField5/>
               <CustomField6/>
               <CustomField7/>
               <CustomField8/>
               <CustomField9/>
               <CustomField10/>
            </AlternateDocumentId>
            <InvoiceLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </InvoiceLanguage>
            <CommunicationLanguage>
               <LanguageCode>en</LanguageCode>
               <LanguageCountryCode>GB</LanguageCountryCode>
            </CommunicationLanguage>
            <CalculationDecimalPlaces>0</CalculationDecimalPlaces>
            <PreviousInvoiceTaxCountry>ES</PreviousInvoiceTaxCountry>
            <TaxDecisionSet>
               <TaxDecisionSetId>1</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_EXPZ</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Export Zero %</TaxIndicatorName>
                  <TaxIndicatorComment>Export of goods</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>ES</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_ZERO</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Zero%</TaxIndicatorName>
                  <TaxIndicatorComment>VAT zero-rated supply of goods</TaxIndicatorComment>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>DE</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>EXPZ</CombinedTaxIndicator>
               <CommercialIndicator>F</CommercialIndicator>
               <SellerTaxRegCountry>ES</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>DE</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                  
               </SellerTaxTotal>
               <BuyerTaxTotal>
                 
               </BuyerTaxTotal>
               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>2</LineNumber>
                  <ItemNo>2</ItemNo>
                  <ItemType/>
                  <UNSPSC>01121221</UNSPSC>
                  <Classification>M</Classification>
                  <SubClassification>GOODS</SubClassification>
                  <CountryItemClassification/>
                  <NetAmount>10.0</NetAmount>
                  <SellerTax>
                     <SellerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount/>
                           <GrossAmount/>
                           <TaxAmountInLocalCurrency/>
                           <TaxCode/>
                           <TaxType>
                              <TaxTypeName/>
                              <TaxTypeAbbreviation/>
                              <TaxTypeDescription/>
                           </TaxType>
                           <TaxRate/>
                        </TaxCalculationLineComponent>
                     </SellerTaxCountry>
                  </SellerTax>
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <CarrierCountry/>
                     <CarrierState/>
                     <CarrierBusinessUnitCode/>
                     <CarrierBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
                  <BuyerTax>
                     <BuyerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount/>
                           <GrossAmount/>
                           <TaxAmountInLocalCurrency/>
                           <TaxCode/>
                           <TaxType>
                              <TaxTypeName/>
                              <TaxTypeAbbreviation/>
                              <TaxTypeDescription/>
                           </TaxType>
                           <TaxRate/>
                        </TaxCalculationLineComponent>
                     </BuyerTaxCountry>
                  </BuyerTax>
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry/>
                     <TaxRegistrationNumberType/>
                     <TaxRegistrationNumber/>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry/>
                     <TaxRegistrationNumberType/>
                     <TaxRegistrationNumber/>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDecisionSet>
               <TaxDecisionSetId>2</TaxDecisionSetId>
               <SellerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_EXPZ</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Export Zero %</TaxIndicatorName>
                  <TaxIndicatorComment>Export of goods</TaxIndicatorComment>
               </SellerTaxIndicator>
               <SellerTaxCountry>ES</SellerTaxCountry>
               <SellerTaxState>NULL</SellerTaxState>
               <BuyerTaxIndicator>
                  <TaxIndicatorAbbreviation>MAT_ZERO</TaxIndicatorAbbreviation>
                  <TaxIndicatorName>Zero%</TaxIndicatorName>
                  <TaxIndicatorComment>VAT zero-rated supply of goods</TaxIndicatorComment>
               </BuyerTaxIndicator>
               <BuyerTaxCountry>DE</BuyerTaxCountry>
               <BuyerTaxState>NULL</BuyerTaxState>
               <CombinedTaxIndicator>EXPZ</CombinedTaxIndicator>
               <CommercialIndicator>F</CommercialIndicator>
               <SellerTaxRegCountry>ES</SellerTaxRegCountry>
               <SellerTaxRegState>NULL</SellerTaxRegState>
               <BuyerTaxRegCountry>DE</BuyerTaxRegCountry>
               <BuyerTaxRegState>NULL</BuyerTaxRegState>
               <SellerTaxTotal>
                 
               </SellerTaxTotal>
               <BuyerTaxTotal>
                  
               </BuyerTaxTotal>

               <TaxComment>
                  <TaxCommentType/>
                  <TaxCommentText/>
               </TaxComment>
               <InvoiceCurrency>
                  <CurrencyCode>EUR</CurrencyCode>
                  <SellerLocalTaxCurrencyCode/>
                  <BuyerLocalTaxCurrencyCode/>
               </InvoiceCurrency>
               <LegalTaxCalculationLevel>G</LegalTaxCalculationLevel>
               <TaxInvoiceLine>
                  <LineNumber>1</LineNumber>
                  <ItemNo>1</ItemNo>
                  <ItemType/>
                  <UNSPSC>56000001</UNSPSC>
                  <Classification>M</Classification>
                  <SubClassification>GOODS</SubClassification>
                  <CountryItemClassification/>
                  <NetAmount>10.0</NetAmount>
                  <SellerTax>
                     <SellerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount/>
                           <GrossAmount/>
                           <TaxAmountInLocalCurrency/>
                           <TaxCode/>
                           <TaxType>
                              <TaxTypeName/>
                              <TaxTypeAbbreviation/>
                              <TaxTypeDescription/>
                           </TaxType>
                           <TaxRate/>
                        </TaxCalculationLineComponent>
                     </SellerTaxCountry>
                  </SellerTax>
                  <VariableTaxSteeringInput>
                     <ConsignorCountry/>
                     <ConsignorState/>
                     <ConsignorBusinessUnitCode/>
                     <ConsignorBusinessUnitType/>
                     <ConsigneeCountry/>
                     <ConsigneeState/>
                     <ConsigneeBusinessUnitCode/>
                     <ConsigneeBusinessUnitType/>
                     <CarrierCountry/>
                     <CarrierState/>
                     <CarrierBusinessUnitCode/>
                     <CarrierBusinessUnitType/>
                     <ShipmentStartCountry/>
                     <ShipmentEndCountry/>
                     <ShipmentStartState/>
                     <ShipmentEndState/>
                     <ServiceRenderedCountry/>
                     <ServiceRenderedState/>
                     <ResalePurpose/>
                     <IsOutBonded/>
                     <IsInBonded/>
                     <TaxPreAlgorithmOutput>
                        <IsExport/>
                        <IsImport/>
                        <IsExported/>
                        <IsImported/>
                     </TaxPreAlgorithmOutput>
                     <ShippingOfCustomsClearedGoods/>
                  </VariableTaxSteeringInput>
                  <BuyerTax>
                     <BuyerTaxCountry>
                        <TaxCalculationLineComponent>
                           <TaxAmount/>
                           <GrossAmount/>
                           <TaxAmountInLocalCurrency/>
                           <TaxCode/>
                           <TaxType>
                              <TaxTypeName/>
                              <TaxTypeAbbreviation/>
                              <TaxTypeDescription/>
                           </TaxType>
                           <TaxRate>0</TaxRate>
                        </TaxCalculationLineComponent>
                     </BuyerTaxCountry>
                  </BuyerTax>
               </TaxInvoiceLine>
               <SellerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry/>
                     <TaxRegistrationNumberType/>
                     <TaxRegistrationNumber/>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </SellerTaxInformation>
               <BuyerTaxInformation>
                  <TaxRegistration>
                     <TaxRegistrationCountry/>
                     <TaxRegistrationNumberType/>
                     <TaxRegistrationNumber/>
                  </TaxRegistration>
                  <TaxRepresentative/>
               </BuyerTaxInformation>
            </TaxDecisionSet>
            <TaxDate>
               <TaxAlgorithmDate>2014-01-11</TaxAlgorithmDate>
            </TaxDate>
            <TaxModuleBehaviour>
               <SkipCalculation>N</SkipCalculation>
               <SkipDecision>Y</SkipDecision>
            </TaxModuleBehaviour>
            <VariableTaxSteeringInput>
               <ConsignorCountry>ES</ConsignorCountry>
               <ConsignorState>ESTF</ConsignorState>
               <ConsignorBusinessUnitCode>test</ConsignorBusinessUnitCode>
               <ConsignorBusinessUnitType/>
               <ConsigneeCountry>FR</ConsigneeCountry>
               <ConsigneeState/>
               <ConsigneeBusinessUnitCode>7522</ConsigneeBusinessUnitCode>
               <ConsigneeBusinessUnitType>COM</ConsigneeBusinessUnitType>
               <CarrierCountry/>
               <CarrierState/>
               <CarrierBusinessUnitCode/>
               <CarrierBusinessUnitType/>
               <ShipmentStartCountry/>
               <ShipmentEndCountry/>
               <ShipmentStartState/>
               <ShipmentEndState/>
               <ServiceRenderedCountry/>
               <ServiceRenderedState/>
               <ResalePurpose>Y</ResalePurpose>
               <IsOutBonded>N</IsOutBonded>
               <IsInBonded>N</IsInBonded>
               <TaxPreAlgorithmOutput>
                  <IsExport>Y</IsExport>
                  <IsImport>N</IsImport>
                  <IsExported>N</IsExported>
                  <IsImported>N</IsImported>
               </TaxPreAlgorithmOutput>
               <ShippingOfCustomsClearedGoods/>
            </VariableTaxSteeringInput>
            <BuyerParty>
               <Party>
                  <BusinessUnitCode>7522</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>MAIN</AddressType>
                     <City>HOFHEIM-WALLAU</City>
                     <PostBox/>
                     <Street>AM WANDERSMANN 2-4</Street>
                     <ZipCode>65719</ZipCode>
                     <CountryCode>FR</CountryCode>
                     <StateCode/>
                     <CountryOfLegalRegistration>FR</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </BuyerParty>
            <SellerParty>
               <Party>
                  <BusinessUnitCode>7008</BusinessUnitCode>
                  <BusinessUnitType>COM</BusinessUnitType>
                  <BusinessUnitName/>
                  <PartyAddress>
                     <AddressType>MAIN</AddressType>
                     <City>Telde</City>
                     <PostBox/>
                     <Street>Autopista Las Palmas - Gando Knm 12</Street>
                     <ZipCode>E-352 19</ZipCode>
                     <CountryCode>ES</CountryCode>
                     <StateCode>ESTF</StateCode>
                     <CountryOfLegalRegistration>ES</CountryOfLegalRegistration>
                  </PartyAddress>
               </Party>
            </SellerParty>
            <TermOfDelivery>DDU</TermOfDelivery>

  </arg0>
 </ws:applyTax>
</soap:Body>
</soap:Envelope>